fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланированиеОтпусковСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>EnumRef.ВКМ_КатегорииСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанныхВХранилище = Параметры.АдресДанных;
	
	ОтпускиСотрудников = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	
	ЗаполнитьДиаграммуГанта(ОтпускиСотрудников);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ДанныеИзХранилища)
	
	Диаграмма = ГрафикОтпусков;
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	ГодДатой = ДанныеИзХранилища.Год;		//Масштаб
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(ГодДатой), КонецГода(ГодДатой));
	
	Серия = Диаграмма.Серии.Добавить();
	Серия.Текст = "Отпуск";
		
	ТочкаГод = Диаграмма.Точки.Добавить();
	ТочкаГод.Текст = Формат(ГодДатой, "ДФ=yyyy") + " год";
	
	ЭлементыШкалы = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы;
	КолвоЭлементов = ЭлементыШкалы.Количество();

	Для Счетчик = 1 По КолвоЭлементов Цикл
	    ЭлементыШкалы.Удалить(ЭлементыШкалы[0]);
	КонецЦикла;

	УровеньГод = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();		// уровень года
	УровеньГод.Единица = ТипЕдиницыШкалыВремени.Год;
	УровеньГод.Формат = "ДФ=гггг";


	УровеньМесяц = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();		// уровень Месяца "Янв", "Фев"
	УровеньМесяц.Единица = ТипЕдиницыШкалыВремени.Месяц;
	УровеньМесяц.Формат = "ДФ=MMM";

	ТаблицаОтпусков = ДанныеИзХранилища.Отпуск;
	
	
	УникальныеСотрудники = ТаблицаОтпусков.Скопировать();			//Формирование списка нужным мне стилем
	УникальныеСотрудники.Свернуть("Сотрудник, Категория"); 
	УникальныеСотрудники.Сортировать("Категория Возр, Сотрудник Возр");
	
	ТекущаяКатегория = Неопределено;

	Для Каждого СтрСотрудник Из УникальныеСотрудники Цикл

	    Если СтрСотрудник.Категория <> ТекущаяКатегория Тогда
	        ТекущаяКатегория = СтрСотрудник.Категория;
	        ТочкаКатегория = ТочкаГод.Точки.Добавить();
			ТочкаКатегория.Текст = "=== " + ВРег(Строка(ТекущаяКатегория)) + " ===";
        КонецЕсли;
    
    	ТекущийСотрудник = СтрСотрудник.Сотрудник;
   
		ТочкаСотрудник = ТочкаГод.Точки.Добавить();			// Создал точку сотрудника внутри точки года
		ТочкаСотрудник.Текст = Строка(ТекущийСотрудник);
		ТочкаСотрудник.Значение = ТекущийСотрудник;
		
		СчетчикПериодов = 0;
		
		Для Каждого СтрокаОтпуска Из ТаблицаОтпусков Цикл
			
			Если СтрокаОтпуска.Сотрудник <> ТекущийСотрудник Тогда
				Продолжить;
			КонецЕсли;
			
			СчетчикПериодов = СчетчикПериодов + 1;
			ДнейЧислом = (КонецДня(СтрокаОтпуска.ДатаОкончания) - НачалоДня(СтрокаОтпуска.ДатаНачала) + 1) / 86400;
			ДнейОтпуска = Макс(Цел(ДнейЧислом), 0);

			ТочкаПериод = ТочкаСотрудник.Точки.Добавить();
			ТочкаПериод.Текст = СтрШаблон("%1 - ая часть отпуска (%2 дн.)", СчетчикПериодов, ДнейОтпуска);

			ЗначениеГод = Диаграмма.ПолучитьЗначение(ТочкаГод, Серия);		// Интервал на уровне Года
			ИнтервалГод = ЗначениеГод.Добавить();
			ИнтервалГод.Начало = СтрокаОтпуска.ДатаНачала;
			ИнтервалГод.Конец  = СтрокаОтпуска.ДатаОкончания;
		
			ЗначениеСотрудник = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, Серия);		// Интервал на уровне Сотрудника
			ИнтервалСотрудник = ЗначениеСотрудник.Добавить();
			ИнтервалСотрудник.Начало = СтрокаОтпуска.ДатаНачала;
			ИнтервалСотрудник.Конец  = СтрокаОтпуска.ДатаОкончания;
			ИнтервалСотрудник.Цвет = WebЦвета.ЗеленоЖелтый;			
			ИнтервалСотрудник.Текст = Строка(ТекущийСотрудник) + ": " + Формат(СтрокаОтпуска.ДатаНачала, "ДФ=dd.MM") + " - " + Формат(СтрокаОтпуска.ДатаОкончания, "ДФ=dd.MM.yy");
						
			ЗначениеПериод = Диаграмма.ПолучитьЗначение(ТочкаПериод, Серия);		// Интервал на уровне Периода
			ИнтервалПериод = ЗначениеПериод.Добавить();
			ИнтервалПериод.Начало = СтрокаОтпуска.ДатаНачала;
			ИнтервалПериод.Конец  = СтрокаОтпуска.ДатаОкончания;
			ИнтервалПериод.Цвет   = WebЦвета.СветлоЗеленый;
			ИнтервалПериод.Текст  = Строка(ТекущийСотрудник) + ": " + Строка(ДнейОтпуска) + " дн.";		
	
		КонецЦикла;
		
	КонецЦикла;

	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
